/*
6. В системе бронирования авиационных билетов имеется следующая информация:
1) перечень рейсов;
2) список пассажиров на каждый рейс;
3) очередь пассажиров, в случае когда число заявок на билеты превышает количество мест.

Организовать в основной памяти хешированный список пассажиров.
Выдать по имени пассажира полную информацию обо всех списках и очередях, в которых он находится.
Считать, что величина каждой очереди ограничена количеством мест на соответствующем рейсе.
*/
#include <iostream>

using std::cout;
using std::endl;

class Booking
{
public:

	Booking()
	{
		for (int i = 0; i < 9; i++)		
			flights[i].flightNumber = i;
	}

	void GetInfo(std::string passenger)
	{
		int hash = ReturnHash(passenger);
		if (passegers[hash].lastName == passenger)
		{
			for (int i = 0; i < passegers[hash].flightsQ; i++)
			{
				cout << "На борту самолета №" << passegers[hash].flights[i]->flightNumber;

				if (passegers[hash].flightsTikets[passegers[hash].flights[i]->flightNumber] < 51)
					cout << " пассажир " << passenger << "  занимает " << passegers[hash].flightsTikets[passegers[hash].flights[i]->flightNumber] << " место" << endl;
				else
					cout << " пассажир " << passenger << "  поставлен в очередь под номером " << passegers[hash].flightsTikets[passegers[hash].flights[i]->flightNumber] << endl;
			}
		}

	}

	void BuyTicket(std::string passenger, int flightNumber)
	{
		int hash = ReturnHash(passenger);
		if (passegers[hash].lastName == passenger || passegers[hash].lastName == "")
		{
			passegers[hash].lastName = passenger;

			if (flights[flightNumber].occupiedQ < 50)
			{
				flights[flightNumber].passengerList[flights[flightNumber].occupiedQ] = hash;
				passegers[hash].flightsTikets[flightNumber] = flights[flightNumber].occupiedQ;
				cout <<"Пассажир "<< passenger << " занял " << flights[flightNumber].occupiedQ << " место в самолете №"<< flights[flightNumber].flightNumber << endl;
				flights[flightNumber].occupiedQ++;
				passegers[hash].flights[passegers[hash].flightsQ++] = &flights[flightNumber];
			}
			else
				if (flights[flightNumber].queueQ < 100)
				{
					flights[flightNumber].queue[flights[flightNumber].queueQ] = hash;
					passegers[hash].flightsTikets[flightNumber] = flights[flightNumber].queueQ;
					cout << "Свободных мест в самолете №" << flights[flightNumber].flightNumber << " нет." << endl <<"Пассажир " << passenger << " поставлен в очередь." << "Номер в очереди: " << flights[flightNumber].queueQ << endl;
					flights[flightNumber].queueQ++;
					passegers[hash].flights[passegers[hash].flightsQ++] = &flights[flightNumber];
				}
				else
					cout << "Свободных мест на данный рейс нет." << endl;
	
		}
		else
			cout << "Не удалось купить билет для пассажира "<< passenger << endl;
	}


private:
	struct Flight
	{
		int flightNumber;

		int occupiedQ = 0;
		int queueQ = 51;
		int passengerList[50];
		int queue[50];
	} flights[9];

	
	struct Passenger
	{
		std::string lastName = { "" };
		
		int flightsQ = 0;
		Flight* flights[9] = {};

		int flightsTikets[9] = {};

	} passegers[1000];

	int PasengersQ = 0;

	int ReturnHash(std::string s)
	{
		int hash = 0;
		for (int i = 0; i < s.size(); i++)
			hash = hash + int(s[i]) * i;
		hash %= 1000;
		if (hash < 0)
			hash *= -1;
		return hash;
	}
};

int main()
{
	setlocale(0, "");

	std::string passengerList[500] = { "Иванов","Смирнов","Кузнецов","Попов","Васильев","Петров","Соколов","Михайлов","Новиков","Федоров","Морозов","Волков","Алексеев","Лебедев","Семенов","Егоров","Павлов","Козлов","Степанов","Николаев","Орлов","Андреев","Макаров","Никитин","Захаров","Зайцев","Соловьев","Борисов","Яковлев","Григорьев","Романов","Воробьев","Сергеев","Кузьмин","Фролов","Александров","Дмитриев","Королев","Гусев","Киселев","Ильин","Максимов","Поляков","Сорокин","Виноградов","Ковалев","Белов","Медведев","Антонов","Тарасов","Жуков","Баранов","Филиппов","Комаров","Давыдов","Беляев","Герасимов","Богданов","Осипов","Сидоров","Матвеев","Титов","Марков","Миронов","Крылов","Куликов","Карпов","Власов","Мельников","Денисов","Гаврилов","Тихонов","Казаков","Афанасьев","Данилов","Савельев","Тимофеев","Фомин","Чернов","Абрамов","Мартынов","Ефимов","Федотов","Щербаков","Назаров","Калинин","Исаев","Чернышев","Быков","Маслов","Родионов","Коновалов","Лазарев","Воронин","Климов","Филатов","Пономарев","Голубев","Кудрявцев","Прохоров","Наумов","Потапов","Журавлев","Овчинников","Трофимов","Леонов","Соболев","Ермаков","Колесников","Гончаров","Емельянов","Никифоров","Грачев","Котов","Гришин","Ефремов","Архипов","Громов","Кириллов","Малышев","Панов","Моисеев","Румянцев","Акимов","Кондратьев","Бирюков","Горбунов","Анисимов","Еремин","Тихомиров","Галкин","Лукьянов","Михеев","Скворцов","Юдин","Белоусов","Нестеров","Симонов","Прокофьев","Харитонов","Князев","Цветков","Левин","Митрофанов","Воронов","Аксенов","Софронов","Мальцев","Логинов","Горшков","Савин","Краснов","Майоров","Демидов","Елисеев","Рыбаков","Сафонов","Плотников","Демин","Фадеев","Молчанов","Игнатов","Литвинов","Ершов","Ушаков","Дементьев","Рябов","Мухин","Калашников","Леонтьев","Лобанов","Кузин","Корнеев","Евдокимов","Бородин","Платонов","Некрасов","Балашов","Бобров","Жданов","Блинов","Игнатьев","Коротков","Муравьев","Крюков","Беляков","Богомолов","Дроздов","Лавров","Зуев","Петухов","Ларин","Никулин","Серов","Терентьев","Зотов","Устинов","Фокин","Самойлов","Константинов","Сахаров","Шишкин","Самсонов","Черкасов","Чистяков","Носов","Спиридонов","Карасев","Авдеев","Воронцов","Зверев","Владимиров","Селезнев","Нечаев","Кудряшов","Седов","Фирсов","Андрианов","Панин","Головин","Терехов","Ульянов","Шестаков","Агеев","Никонов","Селиванов","Баженов","Гордеев","Кожевников","Пахомов","Зимин","Костин","Широков","Филимонов","Ларионов","Овсянников","Сазонов","Суворов","Нефедов","Корнилов","Любимов","Львов","Горбачев","Копылов","Лукин","Токарев","Кулешов","Шилов","Большаков","Панкратов","Родин","Шаповалов","Покровский","Бочаров","Никольский","Маркин","Горелов","Агафонов","Березин","Ермолаев","Зубков","Куприянов","Трифонов","Масленников","Круглов","Третьяков","Колосов","Рожков","Артамонов","Шмелев","Лаптев","Лапшин","Федосеев","Зиновьев","Зорин","Уткин","Столяров","Зубов","Ткачев","Дорофеев","Антипов","Завьялов","Свиридов","Золотарев","Кулаков","Мещеряков","Макеев","Дьяконов","Гуляев","Петровский","Бондарев","Поздняков","Панфилов","Кочетков","Суханов","Рыжов","Старостин","Калмыков","Колесов","Золотов","Кравцов","Субботин","Шубин","Щукин","Лосев","Винокуров","Лапин","Парфенов","Исаков","Голованов","Коровин","Розанов","Артемов","Козырев","Русаков","Алешин","Крючков","Булгаков","Кошелев","Сычев","Синицын","Черных","Рогов","Кононов","Лаврентьев","Евсеев","Пименов","Пантелеев","Горячев","Аникин","Лопатин","Рудаков","Одинцов","Серебряков","Панков","Дегтярев","Орехов","Царев","Шувалов","Кондрашов","Горюнов","Дубровин","Голиков","Курочкин","Латышев","Севастьянов","Вавилов","Ерофеев","Сальников","Клюев","Носков","Озеров","Кольцов","Комиссаров","Меркулов","Киреев","Хомяков","Булатов","Ананьев","Буров","Шапошников","Дружинин","Островский","Шевелев","Долгов","Суслов","Шевцов","Пастухов","Рубцов","Бычков","Глебов","Ильинский","Успенский","Дьяков","Кочетов","Вишневский","Высоцкий","Глухов","Дубов","Бессонов","Ситников","Астафьев","Мешков","Шаров","Яшин","Козловский","Туманов","Басов","Корчагин","Болдырев","Олейников","Чумаков","Фомичев","Губанов","Дубинин","Шульгин","Касаткин","Пирогов","Семин","Трошин","Горохов","Стариков","Щеглов","Фетисов","Колпаков","Чесноков","Зыков","Верещагин","Минаев","Руднев","Троицкий","Окулов","Ширяев","Малинин","Черепанов","Измайлов","Алехин","Зеленин","Касьянов","Пугачев","Павловский","Чижов","Кондратов","Воронков","Капустин","Сотников","Демьянов","Косарев","Беликов","Сухарев","Белкин","Беспалов","Кулагин","Савицкий","Жаров","Хромов","Еремеев","Карташов","Астахов","Русанов","Сухов","Вешняков","Волошин","Козин","Худяков","Жилин","Малахов","Сизов","Ежов","Толкачев","Анохин","Вдовин","Бабушкин","Усов","Лыков","Горлов","Коршунов","Маркелов","Постников","Черный","Дорохов","Свешников","Гущин","Калугин","Блохин","Сурков","Кочергин","Греков","Казанцев","Швецов","Ермилов","Парамонов","Агапов","Минин","Корнев","Черняев","Гуров","Ермолов","Сомов","Добрынин","Барсуков","Глушков","Чеботарев","Москвин","Уваров","Безруков","Муратов","Раков","Снегирев","Гладков","Злобин","Моргунов","Поликарпов","Рябинин","Судаков","Кукушкин","Калачев","Грибов","Елизаров" };

	Booking booking;

	for (int i = 0; i < 99; i++)
	{
		booking.BuyTicket(passengerList[i], 0);
	}
	
	booking.BuyTicket("test", 0);
	booking.BuyTicket("test", 3);
	booking.BuyTicket("test", 8);


	
	booking.GetInfo("test");

}