/* Проект научно-технической программы задан с помощью
ориентированного графа. Вершина графа соответствует отдельному
исследованию, а дуги показывают очередность выполнения
исследований (каждое исследование может начаться не ранее
окончания предшествующих исследований) . Продолжительность
каждого исследования известна. Задан конечный срок выполнения
проекта. требуется определить максимальный интервал времени для
проведения каждого исследования, чтобы проект мог быть завершен
к назначенному сроку.*/

#include <iostream>

using std::string;
using std::cout;
using std::cin;
using std::endl;
